[Killed] BlockStatement
src/orderService.js:1:59
-function calculateTotal(price, quantity, discountPercent) {
-    if (quantity <= 0) throw new Error("Quantity must be positive");
-    if (discountPercent < 0 || discountPercent > 100) throw new Error("Discount must be between 0 and 100");
-    const subtotal = price * quantity;
-    const discount = subtotal * (discountPercent / 100);
-    return subtotal - discount;
-}
+function calculateTotal(price, quantity, discountPercent) {}
 
 function classifyOrder(total) {
killedBy: calculateTotal basic
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: undefined

[Killed] ConditionalExpression
src/orderService.js:2:9
 function calculateTotal(price, quantity, discountPercent) {
-    if (quantity <= 0) throw new Error("Quantity must be positive");
+    if (true) throw new Error("Quantity must be positive");
     if (discountPercent < 0 || discountPercent > 100) throw new Error("Discount must be between 0 and 100");
     const subtotal = price * quantity;
killedBy: calculateTotal basic
statusReason: Error: Quantity must be positive

[Killed] EqualityOperator
src/orderService.js:2:9
 function calculateTotal(price, quantity, discountPercent) {
-    if (quantity <= 0) throw new Error("Quantity must be positive");
+    if (quantity < 0) throw new Error("Quantity must be positive");
     if (discountPercent < 0 || discountPercent > 100) throw new Error("Discount must be between 0 and 100");
     const subtotal = price * quantity;
killedBy: calculateTotal invalid quantity throws
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] EqualityOperator
src/orderService.js:3:9
 function calculateTotal(price, quantity, discountPercent) {
     if (quantity <= 0) throw new Error("Quantity must be positive");
-    if (discountPercent < 0 || discountPercent > 100) throw new Error("Discount must be between 0 and 100");
+    if (discountPercent <= 0 || discountPercent > 100) throw new Error("Discount must be between 0 and 100");
     const subtotal = price * quantity;
     const discount = subtotal * (discountPercent / 100);
killedBy: calculateTotal basic
statusReason: Error: Discount must be between 0 and 100

[Killed] ConditionalExpression
src/orderService.js:3:9
 function calculateTotal(price, quantity, discountPercent) {
     if (quantity <= 0) throw new Error("Quantity must be positive");
-    if (discountPercent < 0 || discountPercent > 100) throw new Error("Discount must be between 0 and 100");
+    if (true) throw new Error("Discount must be between 0 and 100");
     const subtotal = price * quantity;
     const discount = subtotal * (discountPercent / 100);
killedBy: calculateTotal basic
statusReason: Error: Discount must be between 0 and 100

[Killed] ArithmeticOperator
src/orderService.js:4:22
 function calculateTotal(price, quantity, discountPercent) {
     if (quantity <= 0) throw new Error("Quantity must be positive");
     if (discountPercent < 0 || discountPercent > 100) throw new Error("Discount must be between 0 and 100");
-    const subtotal = price * quantity;
+    const subtotal = price / quantity;
     const discount = subtotal * (discountPercent / 100);
     return subtotal - discount;
killedBy: calculateTotal basic
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 2

[Killed] ArithmeticOperator
src/orderService.js:5:22
     if (quantity <= 0) throw new Error("Quantity must be positive");
     if (discountPercent < 0 || discountPercent > 100) throw new Error("Discount must be between 0 and 100");
     const subtotal = price * quantity;
-    const discount = subtotal * (discountPercent / 100);
+    const discount = subtotal / (discountPercent / 100);
     return subtotal - discount;
 }
killedBy: calculateTotal basic
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: -Infinity

[Killed] ArithmeticOperator
src/orderService.js:5:34
     if (quantity <= 0) throw new Error("Quantity must be positive");
     if (discountPercent < 0 || discountPercent > 100) throw new Error("Discount must be between 0 and 100");
     const subtotal = price * quantity;
-    const discount = subtotal * (discountPercent / 100);
+    const discount = subtotal * (discountPercent * 100);
     return subtotal - discount;
 }
killedBy: calculateTotal with discount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 180
Received: -199800

[Killed] ArithmeticOperator
src/orderService.js:6:12
     if (discountPercent < 0 || discountPercent > 100) throw new Error("Discount must be between 0 and 100");
     const subtotal = price * quantity;
     const discount = subtotal * (discountPercent / 100);
-    return subtotal - discount;
+    return subtotal + discount;
 }
 
killedBy: calculateTotal with discount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 180
Received: 220

[Killed] BlockStatement
src/orderService.js:9:31
     return subtotal - discount;
 }
 
-function classifyOrder(total) {
-    if (total >= 1000) return "LARGE";
-    if (total >= 100)  return "MEDIUM";
-    return "SMALL";
-}
+function classifyOrder(total) {}
 
 function isEligibleForFreeShipping(total, isPremiumMember) {
killedBy: classifyOrder large
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LARGE"
Received: undefined

[Killed] ConditionalExpression
src/orderService.js:10:9
 }
 
 function classifyOrder(total) {
-    if (total >= 1000) return "LARGE";
+    if (false) return "LARGE";
     if (total >= 100)  return "MEDIUM";
     return "SMALL";
killedBy: classifyOrder large
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LARGE"
Received: "MEDIUM"

[Killed] ConditionalExpression
src/orderService.js:10:9
 }
 
 function classifyOrder(total) {
-    if (total >= 1000) return "LARGE";
+    if (true) return "LARGE";
     if (total >= 100)  return "MEDIUM";
     return "SMALL";
killedBy: classifyOrder small
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "SMALL"
Received: "LARGE"

[Killed] ConditionalExpression
src/orderService.js:11:9
 
 function classifyOrder(total) {
     if (total >= 1000) return "LARGE";
-    if (total >= 100)  return "MEDIUM";
+    if (true)  return "MEDIUM";
     return "SMALL";
 }
killedBy: classifyOrder small
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "SMALL"
Received: "MEDIUM"

[Killed] EqualityOperator
src/orderService.js:11:9
 
 function classifyOrder(total) {
     if (total >= 1000) return "LARGE";
-    if (total >= 100)  return "MEDIUM";
+    if (total < 100)  return "MEDIUM";
     return "SMALL";
 }
killedBy: classifyOrder small
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "SMALL"
Received: "MEDIUM"

[Killed] StringLiteral
src/orderService.js:12:12
 function classifyOrder(total) {
     if (total >= 1000) return "LARGE";
     if (total >= 100)  return "MEDIUM";
-    return "SMALL";
+    return "";
 }
 
killedBy: classifyOrder small
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "SMALL"
Received: ""

[Killed] BlockStatement
src/orderService.js:15:60
     return "SMALL";
 }
 
-function isEligibleForFreeShipping(total, isPremiumMember) {
-    return isPremiumMember || total >= 50;
-}
+function isEligibleForFreeShipping(total, isPremiumMember) {}
 
 module.exports = { calculateTotal, classifyOrder, isEligibleForFreeShipping };
killedBy: free shipping for premium member
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/orderService.js:16:12
 }
 
 function isEligibleForFreeShipping(total, isPremiumMember) {
-    return isPremiumMember || total >= 50;
+    return false;
 }
 
killedBy: free shipping for premium member
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/orderService.js:16:31
 }
 
 function isEligibleForFreeShipping(total, isPremiumMember) {
-    return isPremiumMember || total >= 50;
+    return isPremiumMember || total > 50;
 }
 
killedBy: free shipping for high total
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
src/orderService.js:19:18
     return isPremiumMember || total >= 50;
 }
 
-module.exports = { calculateTotal, classifyOrder, isEligibleForFreeShipping };
+module.exports = {};
 
killedBy: calculateTotal basic
statusReason: TypeError: calculateTotal is not a function
